org/aw.org
#+TITLE: ActivityWatch stats
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:python :comments link
#+PROPERTY: PRJ-DIR ..

[[https://activitywatch.net/][ActivityWatch]] is a FOSS time tracker software.

* Agent
Usage:
- Run =python -m sqrt_data_agent.aw= once a day

** Saving (Desktop)
:PROPERTIES:
:header-args:python: :tangle (my/org-prj-dir "sqrt_data_agent/aw.py") :comments link
:END:
The agent exports ActivityWatch "buckets" into CSV files.

Some imports:
#+begin_src python
import socket
import argparse
import json
import logging
import os
from collections import deque
from datetime import datetime

import pandas as pd
import requests
import furl

from sqrt_data_agent.api import settings
#+end_src

Buckets have a lot of data, so I need to store the position in each bucket. A JSON file works fine for that.
#+begin_src python
def get_last_updated():
    data = {}
    if os.path.exists(os.path.expanduser(settings['aw']['last_updated'])):
        with open(os.path.expanduser(settings['aw']['last_updated']), 'r') as f:
            data = json.load(f)
    # return data.get(f'last_updated-{get_hostname()}', None)
    return data


def save_last_updated(data):
    os.makedirs(
        os.path.dirname(os.path.expanduser(settings['aw']['last_updated'])),
        exist_ok=True
    )
    hostname = socket.gethostname()
    data[f'last_updated-{hostname}'] = datetime.now().isoformat()
    with open(os.path.expanduser(settings['aw']['last_updated']), 'w') as f:
        json.dump(data, f)
#+end_src

Next, make a DataFrame from the bucket:
#+begin_src python
def get_data(bucket_id, last_updated=None):
    params = {}
    api = settings['aw']['api']
    if last_updated:
        params['start'] = last_updated
    r = requests.get(f'{api}/0/buckets/{bucket_id}')
    bucket = r.json()
    r = requests.get(f'{api}/0/buckets/{bucket_id}/events', params=params)
    data = deque()
    for event in r.json():
        hostname = bucket['hostname']
        if hostname == 'unknown':
            hostname = socket.gethostname()
        data.append(
            {
                'id': f"{bucket_id}-{event['id']}",
                'bucket_id': bucket['id'],
                'hostname': bucket['hostname'],
                'duration': event['duration'],
                'timestamp': pd.Timestamp(event['timestamp']),
                **event['data']
            }
        )
    if len(data) > 0:
        df = pd.DataFrame(data)
        df = df.set_index('id')
        return df
    return None
#+end_src

And perform this operation on all the required buckets.
#+begin_src python
def save_buckets(force=False):
    last_updated = get_last_updated()
    hostname = socket.gethostname()
    last_updated_time = last_updated.get(f'last_updated-{hostname}', None)
    if last_updated_time is not None:
        last_updated_date = datetime.fromisoformat(last_updated_time).date()
        if (datetime.now().date() == last_updated_date and not force):
            logging.info('Already loaded AW today')
            return
    r = requests.get(f'{settings["aw"]["api"]}/0/buckets')
    buckets = r.json()

    os.makedirs(
        os.path.expanduser(settings['aw']['logs_folder']), exist_ok=True
    )
    for bucket in buckets.values():
        if not bucket['type'] in settings['aw']['types']:
            continue
        if 'aw-watcher-web' in bucket['id']:
            last_updated_id = f'{bucket["id"]}-{socket.gethostname()}'
        else:
            last_updated_id = bucket['id']
        if bucket['last_updated'] == last_updated.get(last_updated_id, None):
            logging.info('Bucket %s already saved', bucket['id'])
            continue
        df = get_data(bucket['id'], last_updated.get(last_updated_id, None))
        last_updated[last_updated_id] = bucket['last_updated']
        if df is None:
            logging.info('Bucket %s is empty', bucket['id'])
            continue
        bucket_type = bucket['type'].replace('.', '_')
        hostname = bucket['hostname']
        if hostname == 'unknown':
            hostname = socket.gethostname()
        filename = os.path.join(
            os.path.expanduser(settings['aw']['logs_folder']),
            f"{bucket_type}-{hostname}-{bucket['last_updated']}.csv"
        )
        df.to_csv(filename)
        logging.info('Saved %s with %s events', filename, len(df))
    save_last_updated(last_updated)
#+end_src

#+begin_src python
def main():
    parser = argparse.ArgumentParser(
        prog='sqrt_data_agent.aw'
    )
    parser.add_argument('-f', '--force', action='store_true')
    args = parser.parse_args()
    save_buckets(args.force)

if __name__ == '__main__':
    main()
#+end_src

** Saving (Android)
I couldn't launch the desktop scripts on Android because of numpy, so I opted for manual export + syncing with [[https://play.google.com/store/apps/details?id=dk.tacit.android.foldersync.lite&hl=en&gl=US][FolderSync]] for now.

* Models
The [[https://docs.activitywatch.net/en/latest/buckets-and-events.html][data model]] in the program is pretty reasonable. The top-level entity is called "bucket" and has the following attributes:
- =id=
- =created= - creation date
- =name=
- =type= - type of events in bucket
- =client= - ID of the client software
- =hostname=
And a list of events.

One event has the following attributes:
- =timestamp=
- =duration= - duration in seconds
- =data= - a dictionary with details about the event.

The set of buckets on each machine is dependent on a particular setup. I'm interested in the following types on Desktop:
- =afkstatus= (=aw-watcher-afk=)
  - =status= - "afk" or "not-afk"
- =currentwindow= (=aw-watcher-currentwindow=)
  - =app=
  - =title=
- =app.editor.activity= ([[https://sqrtminusone.xyz/configs/emacs/#activitywatch][activity-watch-mode]])
  - =file=
  - =project=
  - =language=
- =web.tab.current= ([[https://github.com/ActivityWatch/aw-watcher-web][aw-watcher-web]])
  - =url=
  - =title=
  - =audible=
  - =incognito=
  - =tabCount=
And in the following types on Android.
- =os.lockscreen.unlocks= - no data
- =currentwindow=
  - =app=
  - =classname=
  - =package=

Also, (thanks [[https://github.com/ErikBjare][Erik]] for the comment), AW stores timestamps in the UTC format, so I add the =location= field to convert the timestamps as necessary.

** Source models
I don't get to use model inheritance all to often, but seems like it's one case.

Here's the general model:

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/bucket.py")
import sqlalchemy as sa
from sqrt_data_service.models import Base

__all__ = ['Bucket']


class Bucket(Base):
    __table_args__ = {'schema': 'aw'}
    __abstract__ = True

    id = sa.Column(
        sa.String(256),
        primary_key=True,
    )
    bucket_id = sa.Column(sa.String(256), nullable=False)
    hostname = sa.Column(sa.String(256), nullable=False)
    location = sa.Column(sa.String(256), nullable=False)
    timestamp = sa.Column(sa.DateTime(), nullable=False)
    duration = sa.Column(sa.Float(), nullable=False)
#+end_src

And here are the models for specific bucket types:
#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/afkstatus.py")
import sqlalchemy as sa
from .bucket import Bucket

__all__ = ['AfkStatus']

class AfkStatus(Bucket):
    __tablename__ = 'afkstatus'
    __table_args__ = {'schema': 'aw'}

    status = sa.Column(sa.Boolean(), nullable=False)
#+end_src

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/currentwindow.py")
import sqlalchemy as sa
from .bucket import Bucket

__all__ = ['CurrentWindow']

class CurrentWindow(Bucket):
    __tablename__ = 'currentwindow'
    __table_args__ = {'schema': 'aw'}

    app = sa.Column(sa.Text(), nullable=False)
    title = sa.Column(sa.Text(), nullable=False)
#+end_src

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/appeditor.py")
import sqlalchemy as sa
from .bucket import Bucket

__all__ = ['AppEditor']

class AppEditor(Bucket):
    __tablename__ = 'appeditor'
    __table_args__ = {'schema': 'aw'}

    file = sa.Column(sa.Text(), nullable=False)
    project = sa.Column(sa.Text(), nullable=False)
    language = sa.Column(sa.Text(), nullable=False)
#+end_src

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/webtab.py")
import sqlalchemy as sa
from .bucket import Bucket

__all__ = ['WebTab']

class WebTab(Bucket):
    __tablename__ = 'webtab'
    __table_args__ = {'schema': 'aw'}

    url = sa.Column(sa.Text(), nullable=False)
    site = sa.Column(sa.Text(), nullable=False)
    url_no_params = sa.Column(sa.Text(), nullable=False)
    title = sa.Column(sa.Text(), nullable=False)
    audible = sa.Column(sa.Boolean(), nullable=False)
    incognito = sa.Column(sa.Boolean(), nullable=False)
    tab_count = sa.Column(sa.Integer(), nullable=True)
#+end_src

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/android_unlock.py")
import sqlalchemy as sa
from .bucket import Bucket

__all__ = ['AndroidUnlock']

class AndroidUnlock(Bucket):
    __tablename__ = 'android_unlock'
    __table_args__ = {'schema': 'aw'}
#+end_src

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/android_currentwindow.py")
import sqlalchemy as sa
from .bucket import Bucket

__all__ = ['AndroidCurrentWindow']

class AndroidCurrentWindow(Bucket):
    __tablename__ = 'android_currentwindow'
    __table_args__ = {'schema': 'aw'}

    app = sa.Column(sa.Text(), nullable=False)
    classname = sa.Column(sa.Text(), nullable=False)
    package = sa.Column(sa.Text(), nullable=False)
#+end_src

The corresponding =__init__.py=:
#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/models/aw/__init__.py")
from .bucket import *
from .afkstatus import *
from .currentwindow import *
from .appeditor import *
from .webtab import *
from .android_unlock import *
from .android_currentwindow import *
#+end_src
* Flows
The corresponding =__init__.py=:

