org/aw.org
** Loading (Desktop)
:PROPERTIES:
:header-args:python: :tangle (my/org-prj-dir "sqrt_data_service/flows/aw/load.py") :comments link
:END:
The required imports:
#+begin_src python
import furl
import tldextract
import glob
import pandas as pd
import os
import re
import logging

from sqlalchemy.dialects.postgresql import insert as pg_insert
from prefect import task, flow, get_run_logger
from tqdm import tqdm

from sqrt_data_service.api import settings, DBConn, FileHasher
from sqrt_data_service.models import Base
from sqrt_data_service.models.aw import AfkStatus, CurrentWindow, AppEditor, WebTab
from sqrt_data_service.common.locations import LocationMatcher
#+end_src

Get all the dataframes to load:
#+begin_src python
@task(name='aw-desktop-get-dataframes')
def get_dataframes(db):
    logger = get_run_logger()
    files = glob.glob(
        f'{os.path.expanduser(settings["aw"]["logs_folder"])}/*.csv'
    )
    dfs_by_type = {}
    files_by_type = {}
    hasher = FileHasher()
    for f in files:
        if not hasher.is_updated(f, db):
            continue
        try:
            df = pd.read_csv(f, lineterminator='\n', index_col=False)
        except pd.errors.ParserError:
            logging.error(f'Error parsing file: {f}')
            continue
        type_ = re.search(r'^\w+', os.path.basename(f)).group(0)
        try:
            dfs_by_type[type_].append(df)
            files_by_type[type_].append(f)
        except KeyError:
            dfs_by_type[type_] = [df]
            files_by_type[type_] = [f]
        hasher.save_hash(f, db)
    for type, files in files_by_type.items():
        logger.info(f'{type}: {"; ".join(files)}')
    return dfs_by_type
#+end_src

Models by type:
#+begin_src python
MODELS = {
    'afkstatus': AfkStatus,
    'currentwindow': CurrentWindow,
    'app_editor_activity': AppEditor,
    'web_tab_current': WebTab
}
#+end_src

Preprocessing the records.

#+begin_src python
@task(name='aw-desktop-get-records')
def get_records(type_, df):
    loc = LocationMatcher()
    if type_ == 'afkstatus':
        df['status'] = df['status'] == 'not-afk'
    if type_ == 'currentwindow':
        df['app'] = df['app'].apply(
            lambda app: settings['aw']['apps_convert'].get(app, app)
        )
    if type_ == 'web_tab_current':
        df = df.rename({'tabCount': 'tab_count'}, axis=1)
        df['site'] = [
            tldextract.extract(url).registered_domain
            for url in df['url']
        ]
        df['url_no_params'] = [
            furl.furl(url).remove(args=True, fragment=True).url
            for url in df['url']
        ]
    if type_ == 'app_editor_activity':
        if 'branch' in df.columns:
            df = df.drop('branch', axis=1)
    df['timestamp'] = pd.to_datetime(df['timestamp'])
    locations = df.apply(
        lambda row: loc.get_location(row.timestamp, row.hostname), axis=1
    )
    df['location'] = [l[0] for l in locations]
    df['timestamp'] = [l[1] for l in locations]
    return df.to_dict(orient='records')
#+end_src

Insert data:
#+begin_src python
@task(name='aw-desktop-insert-data')
def insert_data(type_, entries, db):
    db.execute(
        pg_insert(MODELS[type_]).values(entries).on_conflict_do_nothing()
    )
#+end_src

The flow to perform the loading:
#+begin_src python
@flow
def aw_load_desktop():
    DBConn()
    DBConn.create_schema('aw', Base)
    logger = get_run_logger()
    with DBConn.get_session() as db:
        dfs_by_type = get_dataframes(db)

        for type_, dfs in tqdm(dfs_by_type.items()):
            for df in dfs:
                entries = get_records(type_, df)
                insert_data(type_, entries, db)
                logger.info(f'Inserted {len(entries)} records of type "{type_}"')
        db.commit()
#+end_src

Execute the flow:
#+begin_src python
if __name__ == '__main__':
    aw_load_desktop()
#+end_src
** Loading (Android)
:PROPERTIES:
:header-args:python: :tangle (my/org-prj-dir "sqrt_data_service/flows/aw/load_android.py") :comments link
:END:
As long as I have only one Android phone where I have ActivityWatch installed, I work with just one JSON file.

The required imports:
#+begin_src python
import json
import pandas as pd

from tqdm import tqdm
from prefect import task, flow, get_run_logger

from sqrt_data_service.api import settings, DBConn, FileHasher
from sqrt_data_service.models import Base
from sqrt_data_service.common.locations import LocationMatcher
#+end_src

The function to get dataframes from the JSON file:
#+begin_src python
@task(name='aw-android-get-dataframes')
def get_dataframes(db):
    logger = get_run_logger()
    hasher = FileHasher()
    if not hasher.is_updated(settings["aw"]["android_file"], db):
        logger.info('Android already loaded')
        return
    dfs_by_type = {}
    with open(settings["aw"]["android_file"], 'r') as f:
        data = json.load(f)
        buckets = data['buckets']
        for bucket in buckets.values():
            df = pd.DataFrame(
                [
                    {
                        'id': f"{bucket['id']}-{event['id']}",
                        'bucket_id': bucket['id'],
                        'hostname': bucket['hostname'],
                        'duration': event['duration'],
                        'timestamp': pd.Timestamp(event['timestamp']),
                        ,**event['data'],
                    } for event in bucket['events']
                ]
            )
            df = df.set_index('id')
            dfs_by_type[bucket['type']] = df
    return dfs_by_type
#+end_src

Also, pre-processing the records.
#+begin_src python
@task(name='aw-android-get-records')
def get_records(type_, df):
    loc = LocationMatcher()
    df['timestamp'] = pd.to_datetime(df['timestamp'])
    locations = df.apply(
        lambda row: loc.get_location(row.timestamp, row.hostname), axis=1
    )
    df['location'] = [l[0] for l in locations]
    df['timestamp'] = [l[1] for l in locations]
    return df
#+end_src

And the flow:
#+begin_src python
TABLE_NAMES = {
    'os.lockscreen.unlocks': 'android_unlock',
    'currentwindow': 'android_currentwindow'
}

@flow
def aw_load_android():
    DBConn()
    DBConn.create_schema('aw', Base)

    hasher = FileHasher()
    with DBConn.get_session() as db:
        dfs_by_type = get_dataframes(db)

        if dfs_by_type is None:
            return

        for type_, df in tqdm(dfs_by_type.items()):
            df = get_records(type_, df)
            df.to_sql(
                TABLE_NAMES[type_],
                schema=settings['aw']['schema'],
                con=DBConn.engine,
                if_exists='replace'
            )
            print(df)
        hasher.save_hash(settings["aw"]["android_file"])
        db.commit()
#+end_src

Execute the flow:
#+begin_src python
if __name__ == '__main__':
    aw_load_android()
#+end_src
