org/aw.org
** Post-processing
:PROPERTIES:
:header-args:python: :tangle (my/org-prj-dir "sqrt_data_service/flows/aw/postprocessing.py") :comments link
:header-args:sql: :noweb-ref postprocess-sql
:END:

The post-processing logic turned out to be rather complex... But well.

One issue is that data from ActivityWatch is somewhat scattered, so the following operations are necessary:
1. filter active windows by not-afk status
2. filter active browser tabs by not-afk status & active browser window

Also, there's a lot of data, so some pre-aggregation is necessary. Ended up implementing this in PL/pgSQL for some reason.

So first, initialize the tables the first level of post-processed data:
#+begin_src sql
drop procedure if exists aw.init_postprocessing();
create procedure aw.init_postprocessing()
    language plpgsql as
$$
begin
    drop table if exists aw.notafkwindow cascade;
    drop table if exists aw.notafktab cascade;
    drop table if exists aw._notafkwindow_meta cascade;
    create table aw.notafkwindow (like aw.currentwindow including all);
    create table aw.notafktab (like aw.webtab including all);
    create table aw._notafkwindow_meta (
        date date primary key,
        count int8
    );

    CREATE OR REPLACE VIEW aw._notafkwindow_meta_diff AS
    WITH current_meta AS (
        select date(timestamp) date, count(*) count
        FROM aw.currentwindow
        GROUP BY date(timestamp)
        ORDER BY date ASC
    )
    SELECT CM.date
    FROM current_meta CM
             LEFT JOIN aw._notafkwindow_meta OM ON CM.date = OM.date
    WHERE CM.count != OM.count OR OM.count IS NULL;
end;
$$;
#+end_src

Next, filter the list of active windows. If:
- the interval of using a program overlaps with the interval of being non-afk, or
- the interval of using a specified program (=aw.skip.afk.apps=, =aw.skip_afk_titles=) overlaps with the interval of being afk less than =aw.skip_afk_interval=
Add that interval to the resulting table. The duration of the new interval is the duration of the overlap.

After some time, I've decided to add the intervals of /being/ AFK to this table as well, but with title & app equal to =AFK=. So first, the function to check the AFK status:
#+begin_src sql
drop function if exists aw.is_afk;
create function aw.is_afk(status bool, duration float, app text, title text) returns bool
    language plpgsql as
$$
begin
    return status = true
        OR (status = false AND duration < current_setting('aw.skip_afk_interval')::int AND
            (app ~ current_setting('aw.skip_afk_apps') OR title ~ current_setting('aw.skip_afk_titles')));
end;
$$;
#+end_src

I iterated through a few implementations of this part, and the most elegant way seems to be to do a join on the =overlaps= operator. CTEs are meant to increase the performance, because otherwise doing such a join on tables with around a million records is quite expensive.

#+begin_src sql
drop function if exists aw.get_notafkwindow;
create function aw.get_notafkwindow(start_date timestamp, end_date timestamp)
    returns table
            (
                like aw.currentwindow
            )
    language plpgsql
AS
$$
begin
    RETURN QUERY
        WITH A AS (SELECT * FROM aw.afkstatus WHERE timestamp BETWEEN start_date AND end_date),
             C AS (SELECT * FROM aw.currentwindow WHERE timestamp BETWEEN start_date AND end_date)
        SELECT concat('afkw-', substring(C.id from '[0-9]+$'), '-', substring(A.id from '[0-9]+$'))::varchar(256) id,
               C.bucket_id,
               C.hostname,
               C.location,
               case
                   when A.timestamp > C.timestamp then A.timestamp
                   else C.timestamp end AS                                                                        timestamp,
               extract(epoch from
                       least(C.timestamp + C.duration * interval '1 second',
                             A.timestamp + A.duration * interval '1 second') -
                       greatest(A.timestamp, C.timestamp))::double precision                                      duration,
               case
                   when aw.is_afk(A.status, A.duration, app, title) then C.app
                   else 'AFK' end       as                                                                        app,
               case
                   when aw.is_afk(A.status, A.duration, app, title) then C.title
                   else 'AFK' end       as                                                                        title
        FROM A
                 INNER JOIN C ON
                ((A.timestamp, A.timestamp + A.duration * interval '1 second')
                    overlaps
                 (C.timestamp, C.timestamp + C.duration * interval '1 second')) AND A.hostname = C.hostname
        ORDER BY timestamp DESC;
end;
$$;
#+end_src

And store all of that into the final table. I used to have a materialized view here, but it doesn't scale well, so I've ended up doing day-by-day processing.

The view to get the list of unprocessed days resides in =init_postprocessing=.

The procedure to perform the processing:
#+begin_src sql
drop procedure if exists aw.postprocess_notafkwindow;
create procedure aw.postprocess_notafkwindow()
    language plpgsql AS
$$
DECLARE
    date date;
begin
    FOR date IN SELECT * FROM aw._notafkwindow_meta_diff
        LOOP
            DELETE FROM aw.notafkwindow WHERE date(timestamp) = date;
            INSERT INTO aw.notafkwindow
            SELECT *
            FROM aw.get_notafkwindow(date, date + interval '1 day')
            ON CONFLICT (id) DO UPDATE SET timestamp = EXCLUDED.timestamp, duration = EXCLUDED.duration;
        end loop;
    DELETE FROM aw._notafkwindow_meta;
    INSERT INTO aw._notafkwindow_meta
    select date(timestamp) date, count(*) count
    FROM aw.currentwindow
    GROUP BY date(timestamp)
    ORDER BY date;
end;
$$;
#+end_src

And one materialized view to aggregate the window data and improve the dashboard performance a bit:
#+begin_src sql
drop procedure if exists aw.create_afkwindow_views();
create procedure aw.create_afkwindow_views()
    language plpgsql as
$$
begin
    CREATE MATERIALIZED VIEW aw.notafkwindow_group AS
    SELECT hostname, location, date(timestamp) date, sum(duration) / (60) total_minutes, app, title
    FROM aw.notafkwindow
    GROUP BY hostname, location, date(timestamp), app, title;
end;
$$;
#+end_src

As for the browser data, one materialized view seems enough for the current quantities. I'll probably optimize this in a year or so.

+One problem here is that timestamps from the browser tab watcher do not quite align with ones from the current window watcher, so calculating overlaps between them gives deflated results. So I truncate the intervals from the current window data to 1 minute+.
#+begin_src sql
drop procedure if exists aw.create_browser_views();
create procedure aw.create_browser_views()
    language plpgsql as
$$
begin
    CREATE MATERIALIZED VIEW aw.webtab_active AS
    WITH W AS (
        SELECT *
        FROM aw.notafkwindow
        WHERE app ~ current_setting('aw.webtab_apps')
        ORDER BY timestamp
    ),
         T AS (SELECT * FROM aw.webtab WHERE url !~ current_setting('aw.skip_urls')),
    res AS (
    SELECT T.bucket_id,
           T.location,
           greatest(W.timestamp, T.timestamp) AS       timestamp,
           extract(epoch from
                   least(T.timestamp + T.duration * interval '1 second',
                         W.timestamp + W.duration * interval '1 second') -
                   greatest(W.timestamp, T.timestamp)) duration,
           T.url,
           T.site,
           T.url_no_params,
           T.title,
           T.audible,
           T.tab_count
    FROM T
             INNER JOIN W ON
        ((W.timestamp, W.timestamp + W.duration * interval '1 second')
            overlaps
         (T.timestamp, T.timestamp + T.duration * interval '1 second'))
    ORDER BY T.timestamp, T.id)
    SELECT * FROM res;
    CREATE MATERIALIZED VIEW aw.webtab_group AS
    SELECT location, date(timestamp) date, sum(duration) / (60) total_minutes, site, url_no_params, title, audible, tab_count
    FROM aw.webtab_active
    GROUP BY location, date(timestamp), site, url_no_params, title, audible, tab_count;
end
$$;
#+end_src

The Python part sets the database settings from the configuration file and executes the stuff above. I wanted to make a separate .sql file for that, but that would make packaging more complicated, so here goes noweb.
#+begin_src python :noweb yes
from prefect import task, flow, get_run_logger
from sqrt_data_service.api import settings, DBConn

SQL = """
<<postprocess-sql>>
"""

@task
def update_settings(db):
    db.execute(
        f"""
    SELECT set_config('aw.skip_afk_interval', '{settings['aw']['skip_afk_interval']}', false);
    SELECT set_config('aw.skip_afk_apps', '{settings['aw']['skip_afk_apps']}', false);
    SELECT set_config('aw.skip_afk_titles', '{settings['aw']['skip_afk_titles']}', false);
    SELECT set_config('aw.webtab_apps', '{settings['aw']['webtab_apps']}', false);
    SELECT set_config('aw.skip_urls', '{settings['aw']['skip_urls']}', false);
    """
    )

@task
def init_postprocessing(db):
    db.execute("CALL aw.init_postprocessing();")

@task
def create_afkwindow_views(db):
    db.execute("CALL aw.create_afkwindow_views();")


@task
def create_browser_views(db):
    db.execute("CALL aw.create_browser_views();")


@flow
def aw_postprocessing_init():
    DBConn()
    with DBConn.get_session() as db:
        db.execute(SQL)
        update_settings(db)
        init_postprocessing(db)
        create_afkwindow_views(db)
        # create_browser_views
        db.commit()

@task
def postprocess_notafkwindow(db):
    db.execute("CALL aw.postprocess_notafkwindow();")

@task
def refresh_notafkwindow(db):
    db.execute("REFRESH MATERIALIZED VIEW aw.notafkwindow_group;")

@task
def refresh_webtab(db):
    db.execute("REFRESH MATERIALIZED VIEW aw.webtab_active;")
    db.execute("REFRESH MATERIALIZED VIEW aw.webtab_group;")

@flow
def aw_postprocessing_dispatch():
    DBConn()
    with DBConn.get_session() as db:
        update_settings(db)
        postprocess_notafkwindow(db)
        refresh_notafkwindow(db)
        # refresh_webtab(db)
        db.commit()
#+end_src
** App Interval
:PROPERTIES:
:header-args:python: :tangle (my/org-prj-dir "sqrt_data_service/flows/aw/app_intervals.py") :comments link
:header-args:sql: :noweb-ref postprocess-sql
:END:
Convert stats for certain apps to be compatible with [[file:wakatime.org][WakaTime]].

#+begin_src python
from tqdm import tqdm
from prefect import flow, task
from sqrt_data_service.api import settings, DBConn

import sqlalchemy as sa
import pandas as pd
#+end_src

Get all timestamps for selected apps
#+begin_src python
@task
def extract_data(db=None):
    apps = ', '.join([f"'{app}'" for app in settings.aw.app_interval.apps])
    sql = f"SELECT app, timestamp FROM aw.notafkwindow WHERE app in ({apps}) ORDER BY timestamp ASC"
    with DBConn.ensure_session(db) as db:
        data = db.execute(sa.text(sql)).all()

    app_timestamps = {}
    for app, timestamp in data:
        try:
            app_timestamps[app].append(timestamp)
        except KeyError:
            app_timestamps[app] = [timestamp]
    return app_timestamps
#+end_src

Get total length of intervals per day:
#+begin_src python
@task
def process_data(app_timestamps):
    time_by_day = {}
    for app, timestamps in app_timestamps.items():
        intervals = []
        start = timestamps[0]
        end = timestamps[0]
        for timestamp in tqdm(timestamps[1:]):
            delta = (timestamp - end).total_seconds()
            if delta > settings.aw.app_interval.interval:
                if end > start:
                    intervals.append((start, end))
                start = timestamp
                end = timestamp
            else:
                end = timestamp
        if end > start:
            intervals.append((start, end))

        time_by_day[app] = {}
        for start, end in intervals:
            date = start.date()
            delta = (end - start).total_seconds()
            try:
                time_by_day[app][date] += delta
            except KeyError:
                time_by_day[app][date] = delta
    return time_by_day
#+end_src

Save data:
#+begin_src python
@task
def save_data(time_by_day):
    data = []
    for app, times_per_app in time_by_day.items():
        for date, seconds in times_per_app.items():
            data.append((app, date, seconds))
    df = pd.DataFrame(data, columns=["app", "date", "seconds"])
    df.to_sql(
        "intervals",
        schema=settings["aw"]["schema"],
        con=DBConn.engine,
        if_exists="replace",
    )
#+end_src

#+begin_src python
@flow
def process_app_intervals():
    DBConn()
    with DBConn.get_session() as db:
        raw_data = extract_data(db)
        time_by_day = process_data(raw_data)
        save_data(time_by_day)

if __name__ == "__main__":
    process_app_intervals()
#+end_src

