org/aw.org
** Final flow
The flow that executes all other flows.

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_service/flows/aw/main.py") :comments link
import argparse
from prefect import flow

from .app_intervals import process_app_intervals
from .load import aw_load_desktop
from .load_android import aw_load_android
from .postprocessing import aw_postprocessing_init, aw_postprocessing_dispatch

@flow
def aw_process(init=False):
    aw_load_desktop()
    aw_load_android()
    if init:
        aw_postprocessing_init()
    aw_postprocessing_dispatch()
    process_app_intervals()

if __name__ == '__main__':
    parser = argparse.ArgumentParser(
        prog='sqrt_data_service.flows.aw.main'
    )
    parser.add_argument('-i', '--init', action='store_true')
    args = parser.parse_args()
    aw_process(args.init)
#+end_src

* Deploy
:PROPERTIES:
:header-args:python: :tangle (my/org-prj-dir "sqrt_data_service/flows/aw/deploy.py") :comments link
:END:

Create the deployment:
#+begin_src python
from prefect.deployments import Deployment
from prefect.orion.schemas.schedules import CronSchedule

from sqrt_data_service.api import settings
from .main import aw_process

def create_deploy():
    deployment = Deployment.build_from_flow(
        flow=aw_process,
        name="aw-process",
        work_queue_name=settings.prefect.queue,
        schedule=(CronSchedule(cron="0 3 * * *")),
        parameters={"init": False}
    )
    deployment.apply()

if __name__ == '__main__':
    create_deploy()
#+end_src

Run the following:
#+begin_src bash :tangle no
python -m sqrt_data_service.flows.aw.deploy
#+end_src

To create a deployment until I've found a better way.
